; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=363, out_folder=htg/blocksworld/training, instance_id=81, seed=2105, goal_proportion=0.03

(define (problem blocksworld-81)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 b328 b329 b330 b331 b332 b333 b334 b335 b336 b337 b338 b339 b340 b341 b342 b343 b344 b345 b346 b347 b348 b349 b350 b351 b352 b353 b354 b355 b356 b357 b358 b359 b360 b361 b362 b363 - object)
 (:init 
    (arm-empty)
    (clear b15)
    (on b15 b78)
    (on b78 b334)
    (on b334 b264)
    (on-table b264)
    (clear b209)
    (on b209 b123)
    (on b123 b300)
    (on-table b300)
    (clear b237)
    (on b237 b114)
    (on-table b114)
    (clear b206)
    (on b206 b54)
    (on-table b54)
    (clear b189)
    (on b189 b304)
    (on b304 b87)
    (on b87 b312)
    (on b312 b1)
    (on b1 b270)
    (on b270 b210)
    (on b210 b323)
    (on b323 b230)
    (on b230 b362)
    (on b362 b308)
    (on-table b308)
    (clear b348)
    (on b348 b86)
    (on-table b86)
    (clear b98)
    (on b98 b241)
    (on b241 b240)
    (on b240 b193)
    (on-table b193)
    (clear b288)
    (on-table b288)
    (clear b33)
    (on b33 b244)
    (on-table b244)
    (clear b151)
    (on b151 b326)
    (on-table b326)
    (clear b265)
    (on b265 b260)
    (on b260 b340)
    (on b340 b14)
    (on-table b14)
    (clear b91)
    (on b91 b311)
    (on b311 b318)
    (on-table b318)
    (clear b90)
    (on b90 b350)
    (on b350 b148)
    (on b148 b122)
    (on b122 b39)
    (on b39 b174)
    (on b174 b287)
    (on-table b287)
    (clear b42)
    (on-table b42)
    (clear b63)
    (on-table b63)
    (clear b347)
    (on b347 b97)
    (on b97 b211)
    (on-table b211)
    (clear b61)
    (on b61 b280)
    (on b280 b204)
    (on b204 b338)
    (on b338 b277)
    (on b277 b182)
    (on-table b182)
    (clear b153)
    (on-table b153)
    (clear b88)
    (on b88 b267)
    (on b267 b106)
    (on b106 b79)
    (on b79 b279)
    (on b279 b343)
    (on b343 b89)
    (on-table b89)
    (clear b328)
    (on-table b328)
    (clear b83)
    (on-table b83)
    (clear b200)
    (on b200 b345)
    (on b345 b30)
    (on-table b30)
    (clear b133)
    (on b133 b181)
    (on b181 b319)
    (on-table b319)
    (clear b137)
    (on b137 b331)
    (on-table b331)
    (clear b278)
    (on b278 b314)
    (on b314 b297)
    (on-table b297)
    (clear b109)
    (on b109 b317)
    (on b317 b239)
    (on b239 b233)
    (on b233 b66)
    (on b66 b245)
    (on b245 b250)
    (on b250 b313)
    (on b313 b291)
    (on b291 b57)
    (on b57 b124)
    (on b124 b155)
    (on-table b155)
    (clear b144)
    (on b144 b147)
    (on b147 b11)
    (on-table b11)
    (clear b195)
    (on b195 b96)
    (on-table b96)
    (clear b29)
    (on b29 b361)
    (on-table b361)
    (clear b223)
    (on-table b223)
    (clear b293)
    (on-table b293)
    (clear b178)
    (on-table b178)
    (clear b112)
    (on b112 b177)
    (on b177 b194)
    (on b194 b110)
    (on b110 b226)
    (on b226 b103)
    (on b103 b94)
    (on b94 b354)
    (on-table b354)
    (clear b276)
    (on b276 b126)
    (on-table b126)
    (clear b257)
    (on-table b257)
    (clear b281)
    (on b281 b160)
    (on-table b160)
    (clear b141)
    (on-table b141)
    (clear b171)
    (on b171 b167)
    (on-table b167)
    (clear b163)
    (on-table b163)
    (clear b113)
    (on-table b113)
    (clear b248)
    (on b248 b17)
    (on b17 b227)
    (on-table b227)
    (clear b84)
    (on b84 b342)
    (on b342 b6)
    (on b6 b191)
    (on-table b191)
    (clear b269)
    (on b269 b162)
    (on b162 b4)
    (on-table b4)
    (clear b266)
    (on b266 b64)
    (on b64 b271)
    (on b271 b161)
    (on-table b161)
    (clear b105)
    (on b105 b132)
    (on-table b132)
    (clear b127)
    (on-table b127)
    (clear b284)
    (on b284 b71)
    (on-table b71)
    (clear b19)
    (on-table b19)
    (clear b23)
    (on b23 b59)
    (on b59 b296)
    (on-table b296)
    (clear b55)
    (on b55 b359)
    (on b359 b327)
    (on b327 b82)
    (on b82 b196)
    (on-table b196)
    (clear b8)
    (on b8 b52)
    (on b52 b201)
    (on b201 b236)
    (on b236 b85)
    (on b85 b130)
    (on b130 b149)
    (on b149 b134)
    (on b134 b203)
    (on b203 b285)
    (on-table b285)
    (clear b34)
    (on b34 b92)
    (on b92 b77)
    (on b77 b118)
    (on b118 b62)
    (on b62 b356)
    (on b356 b302)
    (on b302 b283)
    (on b283 b72)
    (on b72 b303)
    (on b303 b292)
    (on b292 b36)
    (on b36 b324)
    (on-table b324)
    (clear b58)
    (on b58 b25)
    (on b25 b187)
    (on b187 b119)
    (on-table b119)
    (clear b198)
    (on-table b198)
    (clear b321)
    (on b321 b286)
    (on b286 b143)
    (on-table b143)
    (clear b351)
    (on b351 b53)
    (on b53 b74)
    (on b74 b306)
    (on-table b306)
    (clear b325)
    (on b325 b330)
    (on b330 b232)
    (on b232 b363)
    (on b363 b107)
    (on-table b107)
    (clear b355)
    (on b355 b205)
    (on b205 b268)
    (on b268 b13)
    (on b13 b261)
    (on b261 b65)
    (on b65 b333)
    (on b333 b258)
    (on b258 b38)
    (on b38 b108)
    (on b108 b43)
    (on b43 b263)
    (on b263 b111)
    (on b111 b353)
    (on-table b353)
    (clear b50)
    (on b50 b125)
    (on b125 b21)
    (on b21 b18)
    (on b18 b142)
    (on b142 b298)
    (on b298 b69)
    (on b69 b154)
    (on b154 b68)
    (on b68 b294)
    (on-table b294)
    (clear b322)
    (on b322 b341)
    (on b341 b202)
    (on b202 b188)
    (on b188 b255)
    (on b255 b357)
    (on b357 b80)
    (on b80 b242)
    (on b242 b73)
    (on b73 b170)
    (on b170 b212)
    (on-table b212)
    (clear b28)
    (on b28 b346)
    (on b346 b213)
    (on b213 b208)
    (on-table b208)
    (clear b32)
    (on-table b32)
    (clear b129)
    (on b129 b192)
    (on b192 b101)
    (on b101 b48)
    (on b48 b273)
    (on b273 b176)
    (on b176 b3)
    (on-table b3)
    (clear b102)
    (on b102 b22)
    (on b22 b184)
    (on b184 b156)
    (on b156 b117)
    (on-table b117)
    (clear b238)
    (on b238 b214)
    (on b214 b332)
    (on b332 b216)
    (on-table b216)
    (clear b131)
    (on b131 b128)
    (on b128 b99)
    (on-table b99)
    (clear b135)
    (on b135 b272)
    (on b272 b207)
    (on b207 b173)
    (on-table b173)
    (clear b44)
    (on b44 b352)
    (on b352 b165)
    (on b165 b47)
    (on-table b47)
    (clear b282)
    (on-table b282)
    (clear b262)
    (on b262 b344)
    (on b344 b180)
    (on b180 b337)
    (on b337 b152)
    (on-table b152)
    (clear b229)
    (on b229 b49)
    (on b49 b309)
    (on b309 b190)
    (on-table b190)
    (clear b275)
    (on b275 b225)
    (on b225 b16)
    (on b16 b56)
    (on-table b56)
    (clear b166)
    (on b166 b301)
    (on b301 b315)
    (on b315 b199)
    (on b199 b256)
    (on b256 b158)
    (on b158 b215)
    (on-table b215)
    (clear b349)
    (on b349 b136)
    (on b136 b305)
    (on b305 b93)
    (on-table b93)
    (clear b51)
    (on b51 b140)
    (on b140 b81)
    (on b81 b146)
    (on b146 b246)
    (on b246 b67)
    (on b67 b360)
    (on b360 b295)
    (on b295 b159)
    (on-table b159)
    (clear b9)
    (on b9 b175)
    (on b175 b104)
    (on b104 b120)
    (on-table b120)
    (clear b45)
    (on b45 b95)
    (on b95 b329)
    (on-table b329)
    (clear b219)
    (on b219 b100)
    (on b100 b41)
    (on b41 b168)
    (on-table b168)
    (clear b145)
    (on b145 b224)
    (on b224 b217)
    (on b217 b76)
    (on b76 b335)
    (on b335 b243)
    (on-table b243)
    (clear b251)
    (on-table b251)
    (clear b254)
    (on b254 b253)
    (on-table b253)
    (clear b274)
    (on b274 b139)
    (on-table b139)
    (clear b231)
    (on-table b231)
    (clear b320)
    (on-table b320)
    (clear b5)
    (on b5 b169)
    (on b169 b10)
    (on b10 b121)
    (on b121 b235)
    (on b235 b179)
    (on b179 b115)
    (on-table b115)
    (clear b164)
    (on b164 b234)
    (on-table b234)
    (clear b172)
    (on b172 b221)
    (on b221 b150)
    (on-table b150)
    (clear b70)
    (on b70 b185)
    (on b185 b2)
    (on b2 b289)
    (on-table b289)
    (clear b157)
    (on-table b157)
    (clear b40)
    (on b40 b183)
    (on b183 b247)
    (on b247 b24)
    (on b24 b316)
    (on-table b316)
    (clear b336)
    (on b336 b12)
    (on b12 b252)
    (on b252 b220)
    (on b220 b27)
    (on-table b27)
    (clear b116)
    (on-table b116)
    (clear b26)
    (on b26 b60)
    (on-table b60)
    (clear b307)
    (on-table b307)
    (clear b290)
    (on b290 b186)
    (on b186 b259)
    (on b259 b197)
    (on b197 b138)
    (on b138 b7)
    (on-table b7)
    (clear b46)
    (on-table b46)
    (clear b299)
    (on b299 b20)
    (on b20 b249)
    (on b249 b35)
    (on b35 b37)
    (on-table b37)
    (clear b228)
    (on b228 b339)
    (on-table b339)
    (clear b222)
    (on b222 b31)
    (on b31 b358)
    (on b358 b218)
    (on b218 b310)
    (on b310 b75)
    (on-table b75))
 (:goal  (and 
    (clear b4)
    (on b4 b1)
    (on b1 b6)
    (on b6 b9)
    (on b9 b3)
    (on b3 b8)
    (on-table b8)
    (clear b7)
    (on b7 b5)
    (on-table b5)
    (clear b10)
    (on b10 b2)
    (on-table b2))))

; plan
1. (unstack b5 b169)
   deleted: (on b5 b169) (clear b5) (arm-empty)
   added: (holding b5) (clear b169)
   goals met: 0 of 13
2. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 1 of 13
3. (unstack b8 b52)
   deleted: (on b8 b52) (clear b8) (arm-empty)
   added: (holding b8) (clear b52)
   goals met: 1 of 13
4. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 2 of 13
5. (unstack b129 b192)
   deleted: (on b129 b192) (clear b129) (arm-empty)
   added: (holding b129) (clear b192)
   goals met: 2 of 13
6. (putdown b129)
   deleted: (holding b129)
   added: (clear b129) (arm-empty) (on-table b129)
   goals met: 2 of 13
7. (unstack b169 b10)
   deleted: (on b169 b10) (clear b169) (arm-empty)
   added: (holding b169) (clear b10)
   goals met: 3 of 13
8. (putdown b169)
   deleted: (holding b169)
   added: (clear b169) (arm-empty) (on-table b169)
   goals met: 3 of 13
9. (unstack b189 b304)
   deleted: (on b189 b304) (clear b189) (arm-empty)
   added: (holding b189) (clear b304)
   goals met: 3 of 13
10. (putdown b189)
   deleted: (holding b189)
   added: (clear b189) (arm-empty) (on-table b189)
   goals met: 3 of 13
11. (unstack b192 b101)
   deleted: (on b192 b101) (clear b192) (arm-empty)
   added: (holding b192) (clear b101)
   goals met: 3 of 13
12. (putdown b192)
   deleted: (holding b192)
   added: (clear b192) (arm-empty) (on-table b192)
   goals met: 3 of 13
13. (unstack b101 b48)
   deleted: (on b101 b48) (clear b101) (arm-empty)
   added: (holding b101) (clear b48)
   goals met: 3 of 13
14. (putdown b101)
   deleted: (holding b101)
   added: (clear b101) (arm-empty) (on-table b101)
   goals met: 3 of 13
15. (unstack b269 b162)
   deleted: (on b269 b162) (clear b269) (arm-empty)
   added: (holding b269) (clear b162)
   goals met: 3 of 13
16. (putdown b269)
   deleted: (holding b269)
   added: (clear b269) (arm-empty) (on-table b269)
   goals met: 3 of 13
17. (unstack b162 b4)
   deleted: (on b162 b4) (clear b162) (arm-empty)
   added: (holding b162) (clear b4)
   goals met: 4 of 13
18. (putdown b162)
   deleted: (holding b162)
   added: (clear b162) (arm-empty) (on-table b162)
   goals met: 4 of 13
19. (unstack b290 b186)
   deleted: (on b290 b186) (clear b290) (arm-empty)
   added: (holding b290) (clear b186)
   goals met: 4 of 13
20. (putdown b290)
   deleted: (holding b290)
   added: (clear b290) (arm-empty) (on-table b290)
   goals met: 4 of 13
21. (unstack b186 b259)
   deleted: (on b186 b259) (clear b186) (arm-empty)
   added: (holding b186) (clear b259)
   goals met: 4 of 13
22. (putdown b186)
   deleted: (holding b186)
   added: (clear b186) (arm-empty) (on-table b186)
   goals met: 4 of 13
23. (unstack b259 b197)
   deleted: (on b259 b197) (clear b259) (arm-empty)
   added: (holding b259) (clear b197)
   goals met: 4 of 13
24. (putdown b259)
   deleted: (holding b259)
   added: (clear b259) (arm-empty) (on-table b259)
   goals met: 4 of 13
25. (unstack b197 b138)
   deleted: (on b197 b138) (clear b197) (arm-empty)
   added: (holding b197) (clear b138)
   goals met: 4 of 13
26. (putdown b197)
   deleted: (holding b197)
   added: (clear b197) (arm-empty) (on-table b197)
   goals met: 4 of 13
27. (unstack b138 b7)
   deleted: (on b138 b7) (clear b138) (arm-empty)
   added: (holding b138) (clear b7)
   goals met: 5 of 13
28. (putdown b138)
   deleted: (holding b138)
   added: (clear b138) (arm-empty) (on-table b138)
   goals met: 5 of 13
29. (unstack b304 b87)
   deleted: (on b304 b87) (clear b304) (arm-empty)
   added: (holding b304) (clear b87)
   goals met: 5 of 13
30. (putdown b304)
   deleted: (holding b304)
   added: (clear b304) (arm-empty) (on-table b304)
   goals met: 5 of 13
31. (unstack b48 b273)
   deleted: (on b48 b273) (clear b48) (arm-empty)
   added: (holding b48) (clear b273)
   goals met: 5 of 13
32. (putdown b48)
   deleted: (holding b48)
   added: (clear b48) (arm-empty) (on-table b48)
   goals met: 5 of 13
33. (unstack b273 b176)
   deleted: (on b273 b176) (clear b273) (arm-empty)
   added: (holding b273) (clear b176)
   goals met: 5 of 13
34. (putdown b273)
   deleted: (holding b273)
   added: (clear b273) (arm-empty) (on-table b273)
   goals met: 5 of 13
35. (unstack b176 b3)
   deleted: (on b176 b3) (clear b176) (arm-empty)
   added: (holding b176) (clear b3)
   goals met: 5 of 13
36. (putdown b176)
   deleted: (holding b176)
   added: (clear b176) (arm-empty) (on-table b176)
   goals met: 5 of 13
37. (unstack b70 b185)
   deleted: (on b70 b185) (clear b70) (arm-empty)
   added: (holding b70) (clear b185)
   goals met: 5 of 13
38. (putdown b70)
   deleted: (holding b70)
   added: (clear b70) (arm-empty) (on-table b70)
   goals met: 5 of 13
39. (unstack b185 b2)
   deleted: (on b185 b2) (clear b185) (arm-empty)
   added: (holding b185) (clear b2)
   goals met: 5 of 13
40. (putdown b185)
   deleted: (holding b185)
   added: (clear b185) (arm-empty) (on-table b185)
   goals met: 5 of 13
41. (unstack b2 b289)
   deleted: (on b2 b289) (clear b2) (arm-empty)
   added: (holding b2) (clear b289)
   goals met: 5 of 13
42. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 6 of 13
43. (unstack b84 b342)
   deleted: (on b84 b342) (clear b84) (arm-empty)
   added: (holding b84) (clear b342)
   goals met: 6 of 13
44. (putdown b84)
   deleted: (holding b84)
   added: (clear b84) (arm-empty) (on-table b84)
   goals met: 6 of 13
45. (unstack b342 b6)
   deleted: (on b342 b6) (clear b342) (arm-empty)
   added: (holding b342) (clear b6)
   goals met: 6 of 13
46. (putdown b342)
   deleted: (holding b342)
   added: (clear b342) (arm-empty) (on-table b342)
   goals met: 6 of 13
47. (unstack b87 b312)
   deleted: (on b87 b312) (clear b87) (arm-empty)
   added: (holding b87) (clear b312)
   goals met: 6 of 13
48. (putdown b87)
   deleted: (holding b87)
   added: (clear b87) (arm-empty) (on-table b87)
   goals met: 6 of 13
49. (unstack b312 b1)
   deleted: (on b312 b1) (clear b312) (arm-empty)
   added: (holding b312) (clear b1)
   goals met: 6 of 13
50. (putdown b312)
   deleted: (holding b312)
   added: (clear b312) (arm-empty) (on-table b312)
   goals met: 6 of 13
51. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 6 of 13
52. (stack b3 b8)
   deleted: (clear b8) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b8)
   goals met: 7 of 13
53. (unstack b9 b175)
   deleted: (on b9 b175) (clear b9) (arm-empty)
   added: (holding b9) (clear b175)
   goals met: 7 of 13
54. (stack b9 b3)
   deleted: (clear b3) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b3)
   goals met: 8 of 13
55. (unstack b6 b191)
   deleted: (on b6 b191) (clear b6) (arm-empty)
   added: (holding b6) (clear b191)
   goals met: 8 of 13
56. (stack b6 b9)
   deleted: (clear b9) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b9)
   goals met: 9 of 13
57. (unstack b1 b270)
   deleted: (on b1 b270) (clear b1) (arm-empty)
   added: (holding b1) (clear b270)
   goals met: 9 of 13
58. (stack b1 b6)
   deleted: (clear b6) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b6)
   goals met: 10 of 13
59. (unstack b10 b121)
   deleted: (on b10 b121) (clear b10) (arm-empty)
   added: (holding b10) (clear b121)
   goals met: 9 of 13
60. (stack b10 b2)
   deleted: (clear b2) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b2)
   goals met: 11 of 13
61. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 10 of 13
62. (stack b4 b1)
   deleted: (clear b1) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b1)
   goals met: 12 of 13
63. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 11 of 13
64. (stack b7 b5)
   deleted: (clear b5) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b5)
   goals met: 13 of 13
